brew 'node'
brew 'bash'
brew 'coreutils' #macos bundled are outdated
brew 'git'
brew 'golang'
brew 'grep'
brew 'nvm'
brew 'neovim'
brew 'python3'
brew 'ripgrep'

brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

cask 'alfred'
cask 'firefox'
cask 'chromium'
cask "font-inconsolata"
cask "font-source-code-pro"
cask 'iterm2'
cask 'mongodb'
cask 'sublime-text'
cask 'visual-studio-code'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

tap 'caskroom/cask'
