tap 'homebrew/cask-fonts'

brew 'node'
brew 'bash'
brew 'coreutils' #macos bundled are outdated
brew 'git'
brew 'grep'
brew 'nvm'
brew 'neovim'
brew 'python3'
brew 'ripgrep'
brew 'lazygit'
brew 'fzf'

brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
cask 'font-hack-nerd-font'

cask 'iterm2'
