tap 'homebrew/cask-fonts'

brew 'node'
brew 'bash'
brew 'coreutils' #macos bundled are outdated
brew 'git'
brew 'grep'
brew 'nvm'
brew 'neovim'
brew 'python3'
brew 'ripgrep'
brew 'helix'

brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
cask 'font-hack-nerd-font'

cask 'alfred'

# cask 'brave-browser'
cask 'google-chrome'
cask 'iterm2'
cask 'sublime-text'
# cask 'visual-studio-code'
cask 'signal'
cask 'slack'
